### License ###
### https://sharpswan.github.io/ ###

### CoinBuySell made by sharpswan ###



"""
코인을 매매하다보면 자기만의 원칙이 생기는데 

그 원칙이 언제 발생할지  매수, 매도 구간의 타이밍을 찾기 위해 하루종일 차트를 보는 것은 시간 낭비가 심한 일이다.

많은 사람들이 지표를 활용하여 매매를 진행하는데 

그 중에서도 RSI는 '(14일간의 상승폭/ (14일간의 상승폭+ 14일간의 하락폭))*100 ' 의 값이 

'70이 넘으면 과매수이므로 매도 구간, 30이하면 과매도이므로 매수 구간'임을 알려주는 지표로써 굉장히 많이 쓰인다.

다음 코드의 목표는 'RSI(Relative Strength Index), 상대성 강도 지수'를 사용하여 코인의 매수, 매도 구간을 알려주어

RSI로 매매를 진행하는 사람들이 차트를 계쏙 쳐다보며 시간을 낭비하는 일이 없도록 하기 위함이다.

거래소는 한국에서 가장 많이 쓰이는 업비트(upbit)와 바이낸스(Binance)를 통해서 진행하려 한다.
"""





